{
    "India": [
        {
            "category": "india",
            "title": "'Apparent betrayal': Turmoil in Bengal BJP as Dilip Ghosh visits Mamata’s temple event",
            "body_text": "Dilip Ghosh attended the inauguration of the Jagannath Dham temple in Digha along with his wife and met chief minister Mamata Banerjee. His presence at the event and praise for the TMC supremo have sparked strong reactions within the BJP, with now Swapan Dasgupta calling the move a “betrayal” The outrage among grassroots BJP Bengal workers at this apparent betrayal by a former state president is too deafening for the national leadership to ignore."
        },
        {
            "category": "india",
            "title": "‘Deplorable act’: Akhilesh Yadav 'fact-checks' BJP leader's 'Pakistani MP' post with Fadnavis photo",
            "body_text": "BJP MP Nishikant Dubey had insinuated that Akhilesh Yadav supported Pakistan. Yadav called the remarks part of a ‘propaganda campaign’ and described them as ‘deplorable’ He also shared a photo of a man in question with   as a fact-check. Dubey posted a photo  of Akh Gilesh with a man named 'Saifullah'"
        },
        {
            "category": "india",
            "title": "Diesel demand growth gathers pace, petrol holds steady in April",
            "body_text": "Diesel sales grew almost 2.9% during the month from a year ago. Sequentially, the growth was sharper at 7.2% over March when sales grew less than 1%. Petrol sales posted an increase of 3.9%, maintaining the pace seen in March. Jet fuel sales grew at 2.5% but not enough to come out of negative territory on a month-on-month basis."
        },
        {
            "category": "india",
            "title": "'Modi govt will uproot terrorism from every inch of India': Amit Shah",
            "body_text": "Pahalgam attackers should not be under the false impression that they have scored a big victory by killing 27 of our citizens. If someone sees this cowardly strike as a big win, they should know that it is the Modi govt they are dealing with, Amit Shah said. Shah was addressing an event to name a road here after the iconic Bodo leader Bodofa Upendranath Brahma. The road-naming event was attended by Assam chief minister Himanta Biswa Sarma."
        },
        {
            "category": "india",
            "title": "Former union minister and Congress leader Girija Vyas succumbs to fire accident injuries",
            "body_text": "Girija Vyas died at a hospital in Ahmedabad on Thursday evening. She had sustained burn injuries on March 31 while performing aarti at her residence. Her dupatta reportedly caught fire from a lamp, leading to critical injuries. She was initially admitted to a private hospital in Udaipur before being referred to Ahmedabad for advanced care. Her brother, Gopal Sharma, confirmed her demise and said the funeral will be held on Friday."
        }
    ],
    "World": [
        {
            "category": "world",
            "title": "South Africa says its peacekeeping troops are withdrawing from rebel-held eastern Congo",
            "body_text": "South African, Malawi and Tanzania peacekeeping troops begin withdrawing from Congo. The troops will travel through neighboring Rwanda to Tanzania and fly home from there. The three countries contributed soldiers to a southern African peacekeeping force. They had been left trapped in eastern Congo after Rwanda-backed M23 rebels launched an offensive in late January and took control of the strategic city of Goma. Fourteen South African and three Malaiwan soldiers were killed in fighting with M23 in January."
        },
        {
            "category": "world",
            "title": "From enjoying ice cream to developing close relationship with President Trump: Musk gives sneak peek of his first 100 days",
            "body_text": "Department of Government Efficiency (DOGE) chief Elon Musk has completed his first 100 days as a special government employee. Musk revealed that he had slept in the White House’s Lincoln bedroom multiple times. He also revealed that Trump gave him a tour of the Lincoln bedroom, and told him all the history. While working as the DOGE chief, Musk said that he was given a small office, which he intended to keep."
        },
        {
            "category": "world",
            "title": "Trump administration releases report critical of youth gender care",
            "body_text": "The report raises alarms about significant risks with puberty blockers and surgeries. The 400-page report was published without named authors. Gender care for youth is a deeply polarizing issue in many countries. Fewer than 0.1 per cent of gender-diverse minors with private insurance received puberty blockers or hormone therapy between 2018 and 2022, according to a recent study. The American Academy of Pediatrics maintains its support for providing transgender adolescents with medically necessary care."
        },
        {
            "category": "world",
            "title": "Tulsi Gabbard on whether she would run for president in 2028: 'I will never...'",
            "body_text": "Tulsi Gabbard is the first female combat veteran to run for president. She spoke with right-wing commentator Megyn Kelly on her show. President Donald Trump has not ruled out running in 2028 either. The 22nd Amendment of the Constitution bars any individual from contesting for the third time but Trump said there are loopholes. The Trump Organization released Trump 2028 merchandise, keeping the conversation about Trump possibly running for a third term alive."
        },
        {
            "category": "world",
            "title": "US, Ukraine sign 'mineral' deal to establish reconstruction investment fund: What we know so far",
            "body_text": "The two countries will establish a joint Reconstruction Investment Fund with each side having equal voting rights. All profits generated by the fund will be directed solely towards Ukraine's development. The agreement stipulates that future US military assistance will be considered as contributions towards the fund. Any entities or individuals who supported Russia's military efforts will be excluded from Ukraine's reconstruction process, including projects financed through this fund. Ukraine confirms that this arrangement will not affect its aspirations for EU membership."
        }
    ],
    "Technology": [
        {
            "category": "technology",
            "title": "Microsoft increases price of Xbox consoles, controllers and games; says ‘we understand that these changes are…’",
            "body_text": "Microsoft has announced a global price hike for its Xbox Series S/X consoles, controllers, and select games. The company has confirmed that it has revised its recommended retail pricing for these products in various markets. The Xbox Series X will now retail for $599.99, marking a $100 increase. The latest price hike comes after Microsoft raised the price of its Xbox series X console in June 2023. Around the same time, Xbox Game Pass also experienced a price increase."
        },
        {
            "category": "technology",
            "title": "'Stay as long as you want...': Elon Musk receives Donald Trump’s support amid White House exit reports",
            "body_text": "Tesla and SpaceX CEO Elon Musk will scale back his involvement with the administration's informal “Department of Government Efficiency” ( DOGE ). Musk, who has served in an advisory capacity, reportedly plans to shift focus back to his business ventures. President Trump expressed deep appreciation for Musk’s contributions and made it clear the tech billionaire was welcome to continue his advisory role for as long as he wished. The move underscores the complex intersection between public service and private enterprise."
        },
        {
            "category": "technology",
            "title": "Satya Nadella says 30% of Microsoft’s code is AI-generated",
            "body_text": "Microsoft CEO Satya Nadella revealed that nearly 30% of the company’s code is written by AI. Satya was speaking before a live audience with Meta CEO Mark Zuckerberg. Zuckerberg said that he isn’t aware of the exact figure, but added that Meta is developing an AI model that can in turn build future versions of its Llama family of AI models. “Our bet is sort of that in the next year probably … maybe half the development is going to be done by AI, as opposed to people, and then that will just kind of increase from there,” Zuckerberg said."
        },
        {
            "category": "technology",
            "title": "How Walmart is taking care of 'fraud problem' at self-checkout machines",
            "body_text": "The change was first highlighted by a Reddit user named matteo360. The user quoted their manager jokingly, calling the new feature a “chastity belt” for the PIN pad. The update follows reports of skimming scams at various Walmart locations. In response to rising incidents of card skimming, some Walmart locations have even removed self-checkout stations entirely. According to the FBI, a skimmer is a card reader disguised to appear as a legitimate part of a payment terminal."
        },
        {
            "category": "technology",
            "title": "Elon Musk prepares his White House exit: What Tesla CEO said on leaving Trump administration, kind of",
            "body_text": "Tesla CEO Elon Musk is scaling back his involvement with the Department of Government Efficiency. DOGE is a federal initiative aimed at reducing government spending and modernizing technology systems. Musk, who was serving as a special government employee, is transitioning from daily in-person engagements at the  White House to remote participation. During the interview, Musk insisted that the transition does not mean that DOGe work is done."
        }
    ],
    "Business": [
        {
            "category": "business",
            "title": "Kohl's fires CEO Ashley Buchanan over undisclosed conflict of interest",
            "body_text": "American   Kohl’s has terminated CEO   following an investigation that uncovered undisclosed   in  .  Effective immediately, chairman   has been appointed interim CEO. Buchanan had arranged business transactions with a vendor established by a personal associate, granting the firm unusually favorable terms, including a substantial consulting agreement. He failed to disclose these relationships as required by the company's code of ethics. Buchanan will forfeit all equity awards, including those granted as part of his recruitment package."
        },
        {
            "category": "business",
            "title": "Sensex rises nearly 4% in April on FII inflows, monsoon hopes, and trade optimism",
            "body_text": "The BSE Sensex benchmark rose by 2,827.32 points (3.65 per cent) during the month. The rally was supported by easing tariff concerns, progress on India-US trade discussions, and a turnaround in foreign institutional investor (FII) activity. Analysts say the sustainability of the current rally will depend on Q4 corporate earnings and global cues, especially from the US markets."
        },
        {
            "category": "business",
            "title": "US manufacturing weakens further in April amid tariff turmoil",
            "body_text": "The Institute for Supply Management's (ISM) manufacturing index slipped to 48.7 per cent in April. Although the reading was marginally better than economists had forecast, it still underscored a deepening slowdown. The April ISM report paints a cautious picture of the road ahead for American manufacturing, with trade tensions, cost pressures, and supply chain bottlenecks continuing to erode confidence in the sector."
        },
        {
            "category": "business",
            "title": "Millions for bosses, peanuts for workers: CEOs pay went up by 50% - 56 times more than workers",
            "body_text": "The average global CEO now earns $4.3 million a year, which is a staggering 50% real-term increase from $2.9 million, in just 6 years from 2019. In stark contrast, the average worker’s wage has risen by just 0.9% over the same period in countries where CEO pay data is available. Billionaires pocketed an average of $206 billion in new wealth, equivalent to $23,500 every hour, in the past year."
        },
        {
            "category": "business",
            "title": "DreamFolks announces Shekhar Sood as new CFO to drive financial growth and innovation",
            "body_text": "Shekhar Sood is a Chartered Accountant, Company Secretary, and executive MBA. He will lead DreamFolks’ overall finance function, spearhead value-driven initiatives, and support the company’s next phase of growth. Previously, Shekhar served as CFO at Bajaj Capital Group, where he played a pivotal role in aligning financial operations with strategic business objectives."
        }
    ]
}